; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-67)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b20)
    (on b20 b2)
    (on b2 b13)
    (on b13 b12)
    (on b12 b3)
    (on-table b3)
    (clear b17)
    (on b17 b15)
    (on b15 b5)
    (on b5 b19)
    (on b19 b8)
    (on b8 b11)
    (on b11 b1)
    (on b1 b14)
    (on b14 b7)
    (on b7 b10)
    (on b10 b9)
    (on b9 b4)
    (on b4 b6)
    (on b6 b18)
    (on-table b18))
 (:goal (and 
(on-table b2)
(on-table b15)
(on-table b14)
(on b7 b15)
(on b16 b14)
(on b18 b2)
(on b20 b7)
(on b1 b18)
(on b6 b16)
))
)

; plan
1. (unstack b17 b15)
   deleted: (on b17 b15) (clear b17) (arm-empty)
   added: (holding b17) (clear b15)
   goals met: 0 of 9
2. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 9
3. (unstack b15 b5)
   deleted: (on b15 b5) (clear b15) (arm-empty)
   added: (holding b15) (clear b5)
   goals met: 0 of 9
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 9
5. (unstack b5 b19)
   deleted: (on b5 b19) (clear b5) (arm-empty)
   added: (holding b5) (clear b19)
   goals met: 1 of 9
6. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 9
7. (unstack b19 b8)
   deleted: (on b19 b8) (clear b19) (arm-empty)
   added: (holding b19) (clear b8)
   goals met: 1 of 9
8. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 9
9. (unstack b8 b11)
   deleted: (on b8 b11) (clear b8) (arm-empty)
   added: (holding b8) (clear b11)
   goals met: 1 of 9
10. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 9
11. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 1 of 9
12. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 9
13. (unstack b1 b14)
   deleted: (on b1 b14) (clear b1) (arm-empty)
   added: (holding b1) (clear b14)
   goals met: 1 of 9
14. (stack b1 b11)
   deleted: (clear b11) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b11)
   goals met: 1 of 9
15. (unstack b14 b7)
   deleted: (on b14 b7) (clear b14) (arm-empty)
   added: (holding b14) (clear b7)
   goals met: 1 of 9
16. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 9
17. (unstack b16 b20)
   deleted: (on b16 b20) (clear b16) (arm-empty)
   added: (holding b16) (clear b20)
   goals met: 2 of 9
18. (stack b16 b14)
   deleted: (clear b14) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b14)
   goals met: 3 of 9
19. (unstack b7 b10)
   deleted: (on b7 b10) (clear b7) (arm-empty)
   added: (holding b7) (clear b10)
   goals met: 3 of 9
20. (stack b7 b15)
   deleted: (clear b15) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b15)
   goals met: 4 of 9
21. (unstack b20 b2)
   deleted: (on b20 b2) (clear b20) (arm-empty)
   added: (holding b20) (clear b2)
   goals met: 4 of 9
22. (stack b20 b7)
   deleted: (clear b7) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b7)
   goals met: 5 of 9
23. (unstack b2 b13)
   deleted: (on b2 b13) (clear b2) (arm-empty)
   added: (holding b2) (clear b13)
   goals met: 5 of 9
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 9
25. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 6 of 9
26. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 6 of 9
27. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 6 of 9
28. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 6 of 9
29. (unstack b4 b6)
   deleted: (on b4 b6) (clear b4) (arm-empty)
   added: (holding b4) (clear b6)
   goals met: 6 of 9
30. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 9
31. (unstack b6 b18)
   deleted: (on b6 b18) (clear b6) (arm-empty)
   added: (holding b6) (clear b18)
   goals met: 6 of 9
32. (stack b6 b16)
   deleted: (clear b16) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b16)
   goals met: 7 of 9
33. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 7 of 9
34. (stack b18 b2)
   deleted: (clear b2) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b2)
   goals met: 8 of 9
35. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 8 of 9
36. (stack b1 b18)
   deleted: (clear b18) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b18)
   goals met: 9 of 9
